fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СохрДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохрВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохрВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохрСотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Получаем условия оплаты сотруднику за работу
	УсловияОплатыСотрудника = ВКМ_Служебный.ПолучитьУсловияОплаты(Дата, Сотрудник);
	
	//Проверка установленных условий оплаты для сотрудника
	Если НЕ УсловияОплатыСотрудника.Пустой() Тогда
		
		//Получаем процент оплаты сотрудника за работу
		Выборка = УсловияОплатыСотрудника.Выбрать();
		Выборка.Следующий();
		ОплачиваемыйПроцент = Выборка.ПроцентОтРабот;
		
		//Проверка корректности даты проведения работ и срока договора
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора")
			= Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда

			ДатаДействияДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,
				"ВКМ_НачалоДействияДоговора, ВКМ_ОкончаниеДействияДоговора");

			Если ДатаДействияДоговора.ВКМ_НачалоДействияДоговора > ДатаПроведенияРабот Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(
				"Дата проведения работ не может быть меньше даты начала действия договора");
			КонецЕсли;

			Если ДатаДействияДоговора.ВКМ_ОкончаниеДействияДоговора < ДатаПроведенияРабот Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(
				"Дата проведения работ не может быть больше даты окончания действия договора");
			КонецЕсли;

			//Получаем стоимость часа работы по договору
			СтоимостьЧасаРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботы");
	
			// регистр ВКМ_ВыполненныеКлиентуРаботы
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
			
			// регистр ВКМ_ВыполненныеСотрудникомРаботы
			Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;

			Для Каждого Строка Из ВыполненныеРаботы Цикл

				Движение1 = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение1.Период = Дата;
				Движение1.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение1.Клиент = Клиент;
				Движение1.Договор = Договор;
				Движение1.Сотрудник = Сотрудник;
				Движение1.ОписаниеРабот = Строка.ОписаниеРабот;
				Движение1.КоличествоЧасов = Строка.ЧасыКОплатеКлиенту;
				
				СуммаКОплате = Движение1.КоличествоЧасов * СтоимостьЧасаРаботы;
				
				Движение1.СуммаКОплате = СуммаКОплате;
				
				Движение2 = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
				Движение2.Период = Дата;
				Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение2.Сотрудник = Сотрудник;
				Движение2.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
				Движение2.СуммаКОплате = СуммаКОплате * ОплачиваемыйПроцент / 100;
				Движение2.ОписаниеРабот = Строка.ОписаниеРабот;
				
			КонецЦикла;
			
		Иначе
			
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Необходимо выбрать договор с видом ""Абонентское обслуживание""");
		
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			"Сотруднику %1 на дату документа не установлены условия оплаты", Сотрудник));
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	СообщениеДокумента = Справочники.ВКМ_УведомленияТелеграмБоту.НайтиПоРеквизиту("ДокументИсточник", Ссылка);
	Если ЗначениеЗаполнено(СообщениеДокумента) Тогда
		СообщениеДокументаОбъект = СообщениеДокумента.ПолучитьОбъект();
		СообщениеДокументаОбъект.Удалить();
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		ТекстСообщения = СтрШаблон("Заказ №%1 от %2
									|Клиент: %3
									|Дата: %4
									|Время начала: %5
									|Время окончания: %6
									|Специалист: %7
									|Описание: %8", 
									Номер, 
									Формат(Дата, "ДФ=dd.MM.yyyy;"), 
									Клиент,
									Формат(ДатаПроведенияРабот, "ДЛФ=DD;"), 
									Формат(ВремяНачалаРабот, "ДФ=HH:mm;"), 
									Формат(ВремяОкончанияРабот, "ДФ=HH:mm;"), 
									Сотрудник, 
									ОписаниеПроблемы);
		
		ЕстьИзменения = Ложь;
		
		Если ЭтоНовый() Тогда

			ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "Новый заказ №");
			СохрСотрудник = Сотрудник;
			СохрДатаПроведенияРабот = ДатаПроведенияРабот;
			СохрВремяНачалаРабот = ВремяНачалаРабот;
			СохрВремяОкончанияРабот = ВремяОкончанияРабот;
			
		Иначе
			
			Если ЗначениеЗаполнено(СохрСотрудник) 
					И СохрСотрудник <> Сотрудник Тогда
						
				ЕстьИзменения = Истина;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "ИЗМЕНЕН заказ №");
				ТекстСообщения = ТекстСообщения + Символы.ПС 
								+ "------------------" + Символы.ПС 
								+ СтрШаблон("Специалист изменен с %1 на %2", 
											СохрСотрудник,
											Сотрудник);
				СохрСотрудник = Сотрудник;
					
			КонецЕсли;

			Если ЗначениеЗаполнено(СохрДатаПроведенияРабот) 
					И СохрДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
						
				ЕстьИзменения = Истина;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "ИЗМЕНЕН заказ №");
				ТекстСообщения = ТекстСообщения + Символы.ПС 
								+ "------------------" + Символы.ПС
								+ СтрШаблон("Дата изменена с %1 на %2", 
											Формат(СохрДатаПроведенияРабот, "ДЛФ=DD;"), 
											Формат(ДатаПроведенияРабот, "ДЛФ=DD;"));
				СохрДатаПроведенияРабот = ДатаПроведенияРабот;
				
			КонецЕсли;

			Если ЗначениеЗаполнено(СохрВремяНачалаРабот) 
					И ЗначениеЗаполнено(СохрВремяОкончанияРабот)
					И (СохрВремяНачалаРабот <> ВремяНачалаРабот 
					ИЛИ СохрВремяОкончанияРабот <> ВремяОкончанияРабот) Тогда
						
				ЕстьИзменения = Истина;
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "ИЗМЕНЕН заказ №");
				ТекстСообщения = ТекстСообщения + Символы.ПС 
								+ "------------------" + Символы.ПС
								+ СтрШаблон("Время проведения работ изменено с %1 - %2 на %3 - %4", 
											Формат(СохрВремяНачалаРабот, "ДФ=HH:mm;"),
											Формат(СохрВремяОкончанияРабот, "ДФ=HH:mm;"), 
											Формат(ВремяНачалаРабот, "ДФ=HH:mm;"), 
											Формат(ВремяОкончанияРабот, "ДФ=HH:mm;"));
				СохрВремяНачалаРабот = ВремяНачалаРабот;
				СохрВремяОкончанияРабот = ВремяОкончанияРабот;							
			КонецЕсли;

		КонецЕсли;

		НикСотрудника = ВКМ_Служебный.ПолучитьНикСотрудника(Сотрудник);
		Если НЕ ПустаяСтрока(НикСотрудника) Тогда

			ТекстСообщения = ТекстСообщения + Символы.ПС + "@" + НикСотрудника;

		КонецЕсли;

		Если ЭтоНовый() ИЛИ ЕстьИзменения Тогда
			ВКМ_Служебный.СоздатьСообщениеДляОтправки(ТекстСообщения, Ссылка);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
#КонецОбласти
